   -- Функция, возвращающая результат возведения в степень
   --   n
   --  a ,
   --
   --  где a - основание степени, n - показатель степени,
   ------------------------------------------------------
   bin_pow :: Integer -> Integer -> Integer
   bin_pow a n | n==0         = 1
               | n `mod` 2==0 = bin_pow (a*a) (n `div` 2)
               | True         = a * bin_pow (a*a)
                                            ((n-1) `div` 2)

   -- ***************************
   -- Неудачные тестовые примеры:
   ------------------------------
   test1 a b = bin_pow a b
   test2 a b = a ^ b 
   test3 a b = bin_pow a b - a^b

