   -- Функция, возвращающая результат модульного
   -- возведения в степень
   --   k
   --  x  mod n,
   --
   --  где x - основание степени,
   --      k - показатель степени,
   --      n - модуль
   --
   -- (э ф ф е к т и в н ы й  алгоритм)
   ---------------------------------------------------
   bin_pow :: Integer -> Integer -> Integer -> Integer
   bin_pow x k n
          | k==0         = 1
          | k `mod` 2==0 = bin_pow (x*x `mod` n)
                                   (k `div` 2) n
          | True         = x * bin_pow (x*x `mod` n)
                                       ((k-1) `div` 2) n `mod` n

   -- **********************************************
   -- Функция возвращает список, содержащий двоичное
   -- разложение натурального числа n
   ----------------------------------
   p10to2 n | n<=1 = [n]
            | True = p10to2 (n `div` 2) ++ [n `rem` 2]

   -- *********************************************
   -- Демонстрация реализации функции, возвращающей
   -- результат модульного возведения в степень
   --   k
   --  x  mod n,
   --
   --  где x - основание степени, 
   --      k - показатель степени,
   --      n - модуль,
   -- с помощью двоичного представления показателя степени
   -------------------------------------------------------
   res :: Integer -> Integer -> Integer -> Integer
   res x k n = product (map (\(a,b) -> if a==0 
                                         then 1
                                         else bin_pow x (2^b) n)
                            z1)
               `mod` n
      where z  = p10to2 k 
            z1 = zipWith (\a b -> (a,b))
                         z
                         (reverse [0..length z -1])

   -- ***************************
   -- Неудачные тестовые примеры:
   -------------------------------------------------------
   test1 = bin_pow 127897891111111111999 2342222 23123333
   test2 = res     127897891111111111999 2342222 23123333
   ------------------------------------------------------
   test3 = bin_pow 12789789111111 2342 23123
   test4 = res     12789789111111 2342 23123
   -----------------------------------------
   test5 = bin_pow 
               123123123423423423422312312312312312312312311231231231231
               123123123123123123343534534423423423423423123123123123
               123124123423422231231231231 
   test6 = res 123123123423423423422312312312312312312312311231231231231
               123123123123123123343534534423423423423423123123123123
               123124123423422231231231231 
