   -- Демонстрация использования интервальной теоремы
   -- Чебышёва
   -- *****************************
   sheb x = x / logBase (exp 1.0) x
   -----------------------------------------------------------
   -- Вычисление доли простых чисел в интервале (10^90,10^100)
   -- относительно интервала (2,10^100)
   ------------------------------------------------------------------
   test1 = sheb (10**100) - sheb (10**90) -- количество простых чисел
   test2 = test1 / sheb (10**100) * 100   -- в процентах
   test3 = 1+ truncate (100 * logBase 2.0 10)
