   -- Демонстрация нахождения линейного разложения наи-
   -- большего общего делителя двух натуральных чисел
   --------------------------------------------------
   linGCD a b = (a*(fst res)+b*(snd res),res)
              where res = linGCD1 a b 1 0 0 1
   ---------------------------------------------
   linGCD1 a0 a1 x0 x1 y0 y1 | a1 == 0 = (x0,y0)
                             | True    = linGCD1 a1 (a0-a1*d)
                                                 x1 (x0-x1*d)
                                                 y1 (y0-y1*d)
                               where d = a0 `div` a1

   -- **********************************************
   -- Демонстрация нахождения всех решений линейного
   -- разложения НОД двух натуральных чисел
   --
   --   (a,b) = x'a + y'b,
   --
   --   x'=x + bk / (a,b), y'=y - ak / (a,b)
   --
   -- для заданного диапазона целых чисел k
   ---------------------------------------------------
   linGCD2 a b k = (nod,map (\x -> ((x' x),(y' x))) k)
                 where res   = linGCD1 a b 1 0 0 1
                       nod   = a*(fst res)+b*(snd res)
                       x' k1 = (fst res)+b*k1 `div` nod
                       y' k1 = (snd res)-a*k1 `div` nod

   -- *************************************************
   -- Демонстрация организации тестирования  функции по
   -- нахождению  в с е х  решений линейного разложения
   -- НОД двух натуральных чисел:
   --
   --   (a,b)=x *a + y *b=...= x *a + y *b, k=1,2,...,n
   --          1      1         n      n
   -------------------------------------------
   testGCD2 a b k = all ((fst (linGCD a b))==)
                        (map (\x -> a*(fst x)+b*(snd x)) res)
                  where res = snd (linGCD2 a b k)

   -- ***************************
   -- Неудачные тестовые примеры:
   ----------------------------------------
   test =   linGCD 1092 988 == (52,(-9,10))
         && linGCD 867 391  == (17,(-9,20))
         && linGCD 18 12    == (6,(1,-1))  
         && linGCD 12 10    == (2,(1,-1))
         && linGCD 15 2     == (1,(1,-7))
   --------------------------------------
   t1 = linGCD2 1092 988 [-10..10] 
   t2 = linGCD2 867 391 [-100..10] 
   t3 = linGCD2 18 12 [0..50] 
   t4 = linGCD2 12 10 [-15..50]
   t5 = linGCD2 15 2 [-30..0]  
   -------------------------------------
   test1 =   testGCD2 1092 988 [-10..10] 
          && testGCD2 867 391 [-100..10] 
          && testGCD2 18 12 [0..50] 
          && testGCD2 12 10 [-15..50]
          && testGCD2 15 2 [-30..0]         
