   -- Демонстрация функции, возвращающей результат
   -- модульного возведения в степень
   --   n
   --  a  (mod m), где a - основание степени, 
   --                  n - показатель степени,
   --                  m - модуль
   --
   -- (э ф ф е к т и в н а я  реализация)
   ---------------------------------------------------
   bin_pow :: Integer -> Integer -> Integer -> Integer
   bin_pow a n m
          | n==0         = 1
          | n `mod` 2==0 = bin_pow (a*a `mod` m) 
                                   (n `div` 2)
                                   m
          | True         = (
                            a * bin_pow (a*a `mod` m)
                                        ((n-1) `div` 2) 
                                        m
                           )              
                           `mod` m

   -- ***************************
   -- Неудачные тестовые примеры:
   ------------------------------------
   test1 = bin_pow 2 5 3 == 2^5 `mod` 3
   test2 = bin_pow 12311234 1231 345 == 12311234^1231 `mod` 345
   test3 = bin_pow a n m 
      where a = 123123123423423423422312312312312312312312311231231231231
            n = 123123123123123123343534534423423423423423123123123123
            m = 123124123423422231231231231 
   test4 = (a ^ n) `mod` m
      where a = 123123123423423423422312312312312312312312311231231231231
            n = 123123123123123123343534534423423423423423123123123123
            m = 123124123423422231231231231 
   test5 = bin_pow 
               (product $ map (\x -> bin_pow x 1108471372359587 
                                               1524160482796811)
               [478, 194, 11, 542, 934, 379, 886, 33, 383, 807])
               11 1524160482796811
   test6 a n m = (length $ show $ bin_pow a n m, length $ show m)
